Documents/УДАЛИТЬ_УстановкаСтоимостиВыработкиРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_УстановкаСтоимостиВыработкиРозницы</Name>
			<Comment>Установка стоимости выработки розницы</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УДАЛИТЬ_СтоимостьВыработкиПотолкаРозница</xr:Item>
				<xr:Item>InformationRegister.УДАЛИТЬ_СтоимостьВыработкиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьСтоимостьВыработкиПотолка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьВыработкиПотолка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБригады</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМонтажныхБригад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтоимостьВыработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_УстановкаСтоимостиВыработкиРозницы/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтоимостьВыработкиНоменклатуры
	Движения.СтоимостьВыработкиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСтоимостьВыработки Из СтоимостьВыработки Цикл
		Движение = Движения.СтоимостьВыработкиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидБригады = ВидБригады;
		Движение.Номенклатура = ТекСтрокаСтоимостьВыработки.Номенклатура;
		Движение.Стоимость = ТекСтрокаСтоимостьВыработки.Стоимость;
	КонецЦикла;
	
	Движения.СтоимостьВыработкиПотолкаРозница.Записывать = Истина;
	Если УстановитьСтоимостьВыработкиПотолка Тогда
		Движение = Движения.СтоимостьВыработкиПотолкаРозница.Добавить();
		Движение.Период = Дата;
		Движение.ВидБригады = ВидБригады;
		Движение.Стоимость = СтоимостьВыработкиПотолка;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
